app/controllers/api/suburbs_controller.rb

    def get_suburbs
      @suburbs = Suburb.all
---
SELECT "suburbs".* FROM "suburbs"

    def suburb_selection
      Suburb.selection(0, params[:max_price].to_i)
---
SELECT "suburbs".* FROM "suburbs"