app/controllers/suburbs_controller.rb

SELECT "suburbs".* FROM "suburbs"
---
  def index
    @suburbs = Suburb.all

SELECT "suburbs".* FROM "suburbs"
---
  def results
      @results = Suburb.selection(0, params[:max_price].to_i, params[:state])